{
    "welcome": "Bienvenue",
    "change_language": "Changer la langue",
    "personal_information": "Informations personnelles",
    "firstName": "Prénom",
    "lastName": "Nom",
    "name": "Nom",
    "gender": "Sexe",
    "dateOfBirth": "Date de naissance",
    "height": "Taille",
    "weight": "Poids",
    "healthDetails": "Détails de santé",
    "activity": "Activité",
    "activityLevel": "Niveau d'activité",
    "options": "Options",
    "editProfile": "Modifier le profil",
    "changePassword": "Changer le mot de passe",
    "termsOfUse": "Conditions d'utilisation",
    "privacyPolicy": "Politique de confidentialité",
    "contactSupport": "Contacter le support",
    "logout": "Déconnexion",
    "deleteAccount": "Supprimer le compte",
    "quantity": "Quantité",
    "gender_male": "homme",
    "gender_female": "femme",
    "gender_other": "autre",
    "proteins": "Protéines",
    "calories": "Calories",
    "carbs": "Glucides",
    "fats": "Lipides",
    "sugar": "Sucres",
    "potassium": "Potassium",
    "magnesium": "Magnésium",
    "calcium": "Calcium",
    "sodium": "Sodium",
    "iron": "Fer",
    "vitaminA": "Vitamine A",
    "vitaminB1": "Vitamine B1",
    "vitaminB5": "Vitamine B5",
    "vitaminB6": "Vitamine B6",
    "vitaminB12": "Vitamine B12",
    "vitaminC": "Vitamine C",
    "vitaminD": "Vitamine D",
    "vitaminE": "Vitamine E",
    "vitaminK": "Vitamine K",
    "folate": "Folate",
    "otherMacro": "Autres macronutriments (optionnel)",
    "textDelete": "Votre compte est sur le point d'être supprimé. Vous perdrez toutes les données qui y sont associées!\n Une déconnexion est nécessaire!\n Pour confirmer, veuillez saisir **DELETE** ci-dessous :",
    "confirm": "Confirmer",
    "cancel": "Annuler",
    "placeholderDelete": "Écrivez DELETE pour confirmer",
    "sedentary": "Sédentaire",
    "lowactive": "Peu actif",
    "moderate": "Modéré",
    "active": "Actif",
    "superactive": "Très actif",
    "newPassord": "Nouveau mot de passe",
    "confirmNewPassword": "Confirmez le nouveau mot de passe",
    "updatePassword": "MODIFIER LE MOT DE PASSE",
    "profile": "Profil",
    "search": "Recherche",
    "save": "SAUVEGARDER",
    "saveText": "Vos objectifs caloriques et nutritionnels seront recalculés et tous les paramètres personnalisés seront remplacés par les nouvelles modifications.\nUne déconnexion est requise !\n Voulez-vous continuer ?",
    "passwordError": "Les mots de passe ne correspondent pas. Veuillez réessayer.",
    "passwordError2": "Le mot de passe doit contenir au moins 6 caractères.",
    "passwordError3": "Le mot de passe doit inclure au moins une lettre majuscule, une lettre minuscule, un chiffre et un caractère spécial.",
    "premiumAccount": "Compte premium",
    "dashboard": "Tableau de bord",
    "work": "Objectif en cours de progression",
    "left": "restant pour atteindre votre objectif",
    "msg_exp": "Bravo ! Objectif quotidien atteint !!! +20 XP gagnés !",
    "workDone": "Objectif atteint !",
    "today": "Aujourd'hui",
    "searchFood": "Rechercher un aliment",
    "list": "Ma liste",

    "modalTitle": "Bienvenue sur Nutri Track !",
    "modalText": "Nutri Track vous aide à suivre votre nutrition et à atteindre vos objectifs de santé.",
    "modalText2": "Vous pouvez gagner 20 XP par jour en complétant vos objectifs quotidiens !",
    "modalText3": "Commencez le suivi dès maintenant pour améliorer votre nutrition et atteindre des niveaux passionnants.",
    "modalButton": "J'ai compris",

    "termsTitle": "Conditions d'utilisation de l'application Nutrition Track",
    "dateTerms": "Dernière mise à jour : 17 juillet 2025",
    "termsTitle1": "Introduction",
    "termsContent": "Bienvenue sur Nutrition Track ! En utilisant notre application, vous acceptez ces conditions d'utilisation. Si vous n'êtes pas d'accord avec ces conditions, veuillez ne pas utiliser l'application. Nous nous réservons le droit de modifier ou de mettre à jour ces conditions à tout moment. Il est de votre responsabilité de consulter régulièrement cette page pour prendre connaissance des éventuelles modifications. Votre utilisation continue de l'application après tout changement constitue votre acceptation des nouvelles conditions.",
    
    "termsTitle2": "Description de l'application",
    "termsContent2": "Nutrition Track est une application conçue pour vous aider à suivre vos habitudes alimentaires, surveiller votre apport calorique, vos macronutriments, et atteindre vos objectifs de santé et de nutrition. L'application vous permet de suivre les aliments que vous consommez, consulter des données nutritionnelles, définir des objectifs, et analyser vos progrès.",

    "termsTitle3": "Utilisation de l'application",
    "termsContent3": "Vous acceptez d'utiliser l'application légalement et conformément à toutes les lois applicables. Vous vous engagez à ne pas utiliser l'application de manière abusive ou à nuire à son bon fonctionnement. Vous êtes responsable de la confidentialité de vos informations personnelles et de la gestion de votre compte.",

    "termsTitle4": "Inscription et compte utilisateur",
    "termsContent4": "Pour accéder à certaines fonctionnalités de l'application, vous devrez créer un compte utilisateur. Vous devez fournir des informations exactes et complètes lors de votre inscription. Il est de votre responsabilité de maintenir la confidentialité de vos identifiants de connexion et d'empêcher tout accès non autorisé à votre compte.",

    "termsTitle5": "Collecte et utilisation des données",
    "termsContent5": "L'application collecte certaines données personnelles nécessaires à son bon fonctionnement, telles que des informations relatives à votre nutrition, vos habitudes alimentaires et les détails de votre compte utilisateur. Veuillez consulter notre politique de confidentialité pour plus d'informations sur la manière dont nous collectons, utilisons et protégeons vos données personnelles.",

    "termsTitle6": "Contenu de l'application",
    "termsContent6": "L'application peut contenir des informations nutritionnelles, des conseils santé et des suggestions, mais ces contenus sont fournis à titre informatif uniquement. Consultez toujours un professionnel de santé avant de prendre des décisions concernant votre nutrition, votre santé ou votre bien-être.",

    "termsTitle7": "Propriété intellectuelle",
    "termsContent7": "Tous les droits de propriété intellectuelle relatifs au contenu, aux fonctionnalités et à la conception de l'application, y compris mais sans s'y limiter les logos, graphiques, icônes et le code source, sont la propriété exclusive de [Nom de l'entreprise]. Vous acceptez de ne pas reproduire, modifier, distribuer ou utiliser tout élément de l'application sans autorisation préalable.",

    "termsTitle8": "Limitation de responsabilité",
    "termsContent8": "L'application est fournie « en l'état », et nous ne garantissons pas qu'elle soit exempte d'erreurs ou de bugs. Nous ne sommes pas responsables des dommages directs ou indirects résultant de l'utilisation de l'application, y compris la perte de données, les erreurs de calcul ou les problèmes de santé.",

    "termsTitle9": "Modifications et résiliation",
    "termsContent9": "Nous nous réservons le droit de suspendre, modifier ou supprimer toute fonctionnalité de l'application à tout moment, sans préavis. Vous pouvez résilier votre compte à tout moment en nous contactant. Nous pouvons également suspendre ou résilier votre accès à l'application si vous violez ces conditions d'utilisation.",

    "termsTitle10": "Liens externes",
    "termsContent10": "L'application peut contenir des liens vers des sites web tiers. Ces liens sont fournis uniquement à titre informatif, et nous ne sommes pas responsables du contenu ou des pratiques de confidentialité de ces sites.",

    "termsTitle11": "Loi applicable et stockage des données",
    "termsContent11": "En utilisant cette application, vous acceptez que les lois françaises régissent tout litige ou problème découlant de son utilisation. Bien que nous opérions en France, les données que vous fournissez peuvent être stockées et traitées sur différents serveurs Google Cloud situés dans diverses régions, y compris en dehors de l'Union européenne. Nous respectons toutes les réglementations applicables en matière de protection des données, notamment le Règlement général sur la protection des données (RGPD), et nous prenons les mesures nécessaires pour garantir que vos données soient traitées de manière sécurisée et conforme à la loi.",

    "termsTitle12": "Contact",
    "termsContent12": "Si vous avez des questions concernant ces conditions d'utilisation, veuillez nous contacter à :",

    "privcayPolicy": "Politique de confidentialité",
    "effectiveDate": "Date d’entrée en vigueur : 17 juillet 2025",

    "privacyTitle1": "Introduction",
    "privacyContent1": "Bienvenue sur Nutrition Track ! Cette politique de confidentialité explique comment nous collectons, utilisons et protégeons vos informations personnelles lorsque vous utilisez notre application. En utilisant Nutrition Track, vous acceptez la collecte et l'utilisation de vos informations conformément à cette politique.",

    "privacyTitle2": "2. Comment nous utilisons vos informations",
    "privacyContent2": "Nous utilisons les informations que nous collectons à diverses fins, notamment :\n\n- Fournir et améliorer notre application\n\n- Personnaliser votre expérience\n\n- Communiquer avec vous, y compris pour vous envoyer des informations promotionnelles ou répondre à vos demandes de service client\n\n- Analyser l’utilisation de l’application et améliorer nos services",

    "privacyTitle3": "3. Partage de vos informations",
    "privacyContent3": "Nous ne vendons, n’échangeons, ni ne transférons vos informations personnelles à des tiers sans votre consentement, sauf si la loi l’exige. Toutefois, nous pouvons partager vos informations avec :\n\n- Prestataires de services : Des prestataires tiers de confiance qui nous aident à exploiter notre application ou à mener nos activités.\n\n- Obligations légales : Si cela est requis par la loi ou pour protéger les droits, la propriété ou la sécurité de nos utilisateurs ou du public, nous pouvons divulguer vos informations.",

    "privacyTitle4": "4. Sécurité des données",
    "privacyContent4": "Nous prenons des mesures raisonnables pour protéger la sécurité de vos informations. Toutefois, aucune méthode de transmission sur Internet n’est totalement sécurisée, et nous ne pouvons garantir une sécurité absolue.",

    "privacyTitle5": "5. Vos choix",
    "privacyContent5": "- Accéder et mettre à jour vos informations : Vous pouvez consulter et mettre à jour vos informations personnelles via les paramètres de l’application ou en nous contactant.\n\n- Se désinscrire : Vous pouvez vous désinscrire des emails promotionnels en cliquant sur le lien de désinscription dans l’email ou en ajustant vos préférences dans l’application.",

    "privacyTitle6": "6. Confidentialité des enfants",
    "privacyContent6": "Notre application n’est pas destinée aux enfants de moins de 5 ans. Nous ne collectons pas sciemment d’informations personnelles auprès d’enfants. Si vous pensez que nous avons collecté des informations personnelles sur un enfant, veuillez nous contacter afin que nous puissions supprimer ces informations.",

    "privacyTitle7": "7. Modifications de cette politique de confidentialité",
    "privacyContent7": "Nous pouvons mettre à jour cette politique de confidentialité de temps à autre. Toute modification sera publiée sur cette page avec une nouvelle date d’entrée en vigueur. Nous vous encourageons à consulter régulièrement cette politique.",

    "privacyTitle8": "8. Contactez-nous",
    "privacyContent8": "Si vous avez des questions ou des préoccupations concernant cette politique de confidentialité, veuillez nous contacter à :",
    "report": "Signaler un problème",
    "subject": "Sélectionner un sujet",
    "selectCategory": "Sélectionner une catégorie",
    "yourMessage": "Votre message",
    "placeholderMessage": "Décrivez votre problème ou votre retour... (2300 caractères max)",
    "date": "Date",
    "sendReport": "Envoyer le rapport",
    "switch": "Changer de mode",
    "generate": "Générer",
    "create": "Créer",
    "textGenerate": "Créez un aliment à partir des données officielles. Entrez une quantité, puis vous pouvez modifier les valeurs nutritionnelles si nécessaire.",
    "textCreate": "Créez un aliment et personnalisez toutes les valeurs nutritionnelles selon vos besoins.",
    "quantityGenerate": "Quantité entre 10 et 250 g",
    "title": "Titre",
    "buttonGenerate": "Générer un aliment",
    "buttonCreate": "Créer un aliment",
    "optional": "optionnel",
    "required": "obligatoire",
    "titleOther": "Autres macronutriments",
    "errorMatching": "Aucun aliment ne correspond à",
    "errorTitle": "Le titre doit contenir uniquement des lettres et comporter au moins 3 caractères.",
    "inform": "L’unité doit uniquement contenir g / cl / ml / l / cup (tasse)",
    "unit": "Unité",
    "informUnit": "/g, cl, ml, l, tasse, portion",
    "errorValidNumber": "Veuillez entrer un nombre valide pour",
    "titleRequired": "Le nom est requis.",
    "titleLettersOnly": "Le nom ne doit contenir que des lettres.",
    "titleMaxLength": "Le nom doit contenir 15 caractères maximum.",
    "editWeight": "Éditer le poids",
    "textEditWeight": "Veuillez mettre à jour votre poids régulièrement, en particulier lorsque vous perdez ou prenez du poids, afin de garantir que vos données restent à jour et que les recommandations personnalisées restent efficaces.",
    "errorEditGoal": "Les protéines, les glucides et les lipides doivent être un nombre compris entre 0 et 100.",
    "informEdit": "Les valeurs sont limitées à 100 pour des raisons de santé nutritionnelle.",
    "editGoal": "Mettre à jour l'objectif",
    "informGoal": "Pour préserver votre santé, un écart modéré entre 300 et 500 kcal est généralement recommandé.",
    "titleEdit": "Ajustez votre apport quotidien en fonction de vos besoins. Que vous souhaitiez perdre ou prendre du poids, personnalisez votre plan facilement."
}